# 1) У вас є список my_list із значеннями типу int. Роздрукувати значення, які більше 100.
# Завдання виконати за допомогою циклу for.

my_list = [5, 939, 27, 234, 183, 2003, 6, 8]
for i in my_list:
    if i > 100:
        print(i)
    else:
        pass
# 2) У вас є список my_list зі значеннями типу int і порожній список my_results. Додати в my_results ті значення,
# які більше 100. Роздрукувати список my_results. Завдання виконати за допомогою циклу for.
my_list = [37, 293, 456, 34, 28, 92, 389, 120, 129]
my_results = []
for i in my_list:
    if i > 100:
        my_results.append(i)
    else:
        pass
print(my_results)
#
# 3) У вас є список my_list із значеннями типу int. Якщо my_list кількість елементів менше 2,
# то в кінець додати значення 0. Якщо кількість елементів більша або дорівнює 2,
# то додати суму останніх двох елементів. Кількість елементів у списку можна отримати за допомогою функції len(my_list)
my_list = [37, 728, 29, 293, 35]
if len(my_list) < 2:
    my_list.append(0)
else:
    x = my_list [-1]
    y = my_list [-2]
    z = (x + y)
    my_list.append(z)
print(my_list)